</s> 208378
the 33311
of 17380
a 11650
is 11382
to 11238
in 9782
and 9639
that 6422
for 6065
we 4512
The 4087
are 4055
be 3507
can 3472
an 2680
by 2612
as 2495
with 2153
if 2020
it 1990
on 1929
from 1893
all 1879
each 1718
center 1532
or 1480
this 1476
one 1469
which 1441
at 1426
program 1426
We 1383
not 1378
then 1368
have 1347
Fig 1314
code 1226
value 1199
only 1176
A 1155
has 1145
In 1127
set 1117
may 1062
two 1053
there 1038
same 1010
If 991
block 971
first 934
ex 924
used 923
any 920
use 886
variable 866
loop 855
so 819
enumerate 811
figure 794
expression 769
statement 735
no 729
its 729
grammar 722
will 720
number 720
analysis 713
where 708
input 707
type 685
point 679
algorithm 678
array 674
into 672
but 665
node 665
1 654
values 649
tabular 647
verbatim 630
also 629
This 613
function 608
some 608
Section 606
these 605
- 605
0 602
variables 601
) 583
other 580
Thus 575
new 568
expressions 558
time 555
state 544
itemize 541
such 535
when 530
stack 520
following 517
possible 515
It 514
using 506
objects 503
For 501
production 499
because 498
figurehtfb 496
must 481
path 473
nodes 472
they 468
flow_graph 466
example 452
shown 449
statements 446
object 446
after 441
x 434
more 433
order 429
need 426
sets 419
graph 418
their 418
method 416
iterations 411
form 410
since 409
entry 409
called 406
instruction 405
data 403
different 399
would 392
find 392
along 385
2 375
definition 373
exer 373
call 371
end 369
language 369
parser 368
string 367
C 366
solution 364
However 363
case 362
sequence 361
compute 360
iteration 354
compiler 352
Since 352
both 351
That 347
return 345
must_be 342
For_example 342
operations 339
procedure 338
second 337
loops 337
information 334
many 333
instructions 328
states 328
executed 324
region 321
tree 317
before 316
such_as 314
blocks 313
does_not 308
cannot 306
next 304
result 304
we_shall 304
nonterminal 303
computed 300
symbol 298
between 297
those 296
given 295
single 293
within 290
like 289
every 289
defined 287
available 287
consider 285
could 284
problem 284
3 284
rules 284
class 282
beginning 282
either 280
represent 277
constant 274
do 273
computation 273
edges 273
As 273
items 273
simple 271
through 271
how 270
true 269
while 269
programs 269
found 269
access 266
see 266
table 265
To 264
paths 261
's 261
transfer_function 261
space 260
uses 257
definitions 252
Example 250
what 250
error 250
operator 249
i 248
basic_block 248
another 246
Note_that 244
functions 244
Then 243
construct 242
types 241
An 240
methods 240
disp 238
rule 237
respectively 236
processor 236
context 235
list 234
assume 234
register 234
memory 233
When 233
do_not 232
get 232
them 232
name 230
Java 230
reduce 230
productions 229
strings 228
than 227
4 225
represents 224
top 223
transfer_functions 223
pointer 222
our 222
symbols 222
edge 220
execution 219
left 218
whose 216
make 216
constraints 216
most 215
three 215
body 214
up 212
itself 211
E 211
operation 210
elements 210
Suppose 209
results 209
attribute 209
registers 208
was 208
create 207
c 207
hexer 204
assignment 203
() 202
exit 202
Algorithm 201
way 201
alg 201
accesses 200
token 200
discussed 198
b 198
parallelism 198
last 197
These 196
5 196
id 196
generate 194
parsing 194
flushleft 194
control 191
simply 191
else 190
know 190
needed 189
refer 189
languages 188
just 187
say 187
right 186
relation 186
tabularl 185
should 185
attributes 185
execute 181
calls 181
therefore 179
step 178
assigned 177
applied 177
size 177
reach 177
references 176
thus 176
were 175
above 175
several 174
consists 173
parse_tree 173
Each 172
similar 172
regions 172
approach 171
place 171
add 171
flow 170
about 170
until 170
l 170
generated 169
take 169
target 169
general 169
out 169
common 168
points 168
constructed 168
( 167
handle 167
fact 167
have_been 167
stmt 167
declaration 167
might 166
change 166
10 166
t 166
machine 166
root 166
names 165
useful 165
appear 164
important 164
whether 164
contexts 163
field 162
determine 162
footnotesize 162
T 161
corresponding 160
Figure 160
a) 159
even 159
this_section 159
b) 158
relations 158
We_shall 158
original 158
line 158
address 157
Here 157
action 156
labeled 156
data-flow 156
pp 156
part 155
has_been 155
represented_by 154
effect 154
associated_with 154
reference 154
matrix 153
based_on 153
NFA 153
label 152
representing 152
does 152
often 152
lexeme 152
apply 151
being 151
' 151
Consider 150
written 150
tokens 150
appears 149
terms 148
generates 148
if_( 148
There 148
header 148
BDD 147
output 147
during 147
work 146
contains 146
never 146
lexical_analyzer 146
There_are 145
int 144
hold 143
replace 142
algorithms 142
equation 142
nonterminals 142
p 141
technique 141
described 141
loop_nest 141
define 141
location 140
always 139
actions 139
returns 138
translation 138
shows 138
analyses 138
basic 138
entire 138
process 137
basic_blocks 137
over 136
once 136
Let 135
steps 135
expr 135
8 134
figurehtb 134
times 134
goto 134
without 133
show 133
start 133
character 133
processors 132
grammars 132
shift 132
include 131
operators 131
takes 131
7 130
framework 130
partition 129
length 129
let 128
write 127
means 127
declarations 127
consisting 126
item 126
pass 125
numbers 125
pipeline 125
call_graph 124
record 124
integer 123
heap 123
techniques 123
collection 123
Let_us 122
lines 122
pair 122
eliminate 122
particular 121
By 121
element 121
6 121
certain 120
created 120
now 120
map 120
generated_by 120
however 119
back 119
necessary 119
as_follows 119
terminal 119
index 118
pointers 118
read 118
domain 118
data-flow_values 118
fields 117
constants 117
reduction 117
reached 117
context-sensitive 116
reaching_definitions 116
optimization 115
j 115
union 115
static 114
y 114
small 114
While 114
At 114
instead 113
produce 113
DFA 113
four 112
identifiers 112
All 112
third 112
chunk 112
d 111
additional 111
or_more 111
syntax 111
children 111
structure 110
c) 110
large 110
added 110
made 109
tabularl_l 109
discuss 109
below 109
vector 109
Finally 108
F 108
Exercise 108
instance 107
initial 107
position 106
efficient 106
executing 106
reuse 106
Notice_that 106
storage 106
exactly 106
th 106
representation 105
becomes 105
(a) 105
for_(i 105
perform 105
lookahead 105
makes 104
procedures 104
here 104
affine 104
integers 104
constructs 104
allow 103
components 103
operands 103
pattern 103
includes 103
On 103
declared 103
activation_record 103
For_instance 102
requires 102
holds 102
characters 102
false 101
parameters 101
implement 101
equivalent 101
(2) 101
describe 101
dependence 101
rest 100
assignments 100
introduce 100
9 100
directly 99
dependences 99
among 99
parallel 99
lexical 99
transition 99
v 98
inner_loop 98
instances 98
finds 98
locations 98
derivation 98
depth 98
Similarly 97
assign 97
usually 97
i) 97
cache 97
match 97
computes 96
still 96
solutions 96
6) 96
problems 96
terminals 96
schedule 96
correct 95
go 95
symbol_table 94
7) 94
previous 94
as_well 94
equations 93
component 93
data-flow_analysis 93
machines 93
meet 93
optimizations 92
global 92
more_than 92
stored 92
s 92
(b) 91
taken 91
local 91
system 91
column 91
scope 91
Yacc 91
Code 90
considered 90
With 90
(1) 90
finding 90
at_least 90
row 90
garbage 90
followed_by 90
done 89
After 89
cost 89
parse 89
meet_operator 89
nested 88
allocated 88
rather_than 88
One 88
independent 88
determined 88
identifier 88
digit 88
syntax_tree 87
computing 87
Datalog 87
First 87
give 87
having 87
head 87
implementation 86
scheme 86
immediately 86
5) 86
From 86
precedence 86
due 86
term 85
choose 85
null 85
replaced_by 84
require 84
empty 84
labels 83
been 83
test 83
improve 83
keyword 83
evaluate 83
errors 83
move 82
follows 82
produces 82
resulting 82
control_flow 81
dynamic 81
other_than 81
executes 81
1) 81
again 81
changes 81
source_program 80
known 80
condition 80
bounds 80
chunks 80
contain 80
notation 80
inequalities 80
outer_loop 80
reachable 80
corresponds 79
introduced 79
although 79
store 79
J 79
Lex 79
compilers 78
very 78
otherwise 78
applications 78
placed 78
performed 78
ie 78
Type 77
entries 77
cases 77
construction 77
bits 77
cycle 77
easily 76
an_integer 76
jumps 76
choice 76
containing 76
transformations 76
known_as 76
reaches 76
Find 76
much 76
refers 76
arrayr 76
copy 75
actual 75
sexer 75
accessed 75
rows 75
digits 75
1)_package 75
appropriate 74
100 74
complete 74
application 74
4) 74
evaluation 74
'' 74
f 73
Also 73
except 73
intermediate_code 73
jump 73
strongly_connected 73
description 72
actually 72
Our 72
arrays 72
suppose 72
garbage_collection 72
reduced 72
SDD 72
pipelining 72
activation 72
classes 71
forms 71
themselves 71
passed 71
across 71
for_(j 71
2) 71
obtain 71
boolean 71
check 71
regular_expression 71
void 71
addresses 70
typically 70
data_dependence 70
further 70
Such 70
begin 70
easy 70
larger 70
examples 70
(ie 70
become 70
Expr 70
allows 69
source 69
put 69
answer 69
Because 69
scheduling 69
0_1 69
free 69
subsequent 69
LR_parser 69
follow 69
predecessor 69
3)_public 69
L 68
whenever 68
amount 68
plus 68
down 68
What 68
graphs 68
proper 68
closure 68
bottom-up 68
three-address_code 67
returned 67
unique 67
solve 67
share 67
defines 67
discussion 67
prefix 67
task 67
enough 66
sequences 66
occur 66
less 66
(3) 66
arrayc 66
B 66
gives 66
present 66
cycles 66
version 66
few 66
iterative_algorithm 66
phase 66
We_say 65
grammar_symbols 65
says_that 65
arguments 65
leaf 65
M 65
10) 65
box 65
temporary 64
correspond 64
run 64
creates 64
idea 64
had 64
patterns 64
Some 64
already 64
final 64
linear 64
main 64
8) 64
next_input 64
round 64
e 63
outside 63
parallelization 63
involving 63
heap_object 63
points-to 63
denote 63
meaning 63
tabularr_c 63
We_now 62
typical 62
parameter 62
special 62
reaching 62
synchronization 62
computations 62
generating 62
predicate 62
tabularr_l 62
changed 62
child 62
11) 62
reducible 62
three-address 61
smaller 61
current 61
remaining 61
parsing_table 61
V 61
evaluated 61
S 61
copies 61
hierarchy 61
factor 61
R2 61
semilattice 61
back_edges 61
natural_loop 61
Using 60
Now 60
Instead 60
properties 60
count 60
display 60
you 60
automatically 60
leaves 60
letters 60
R 60
SDT 60
back_edge 60
depends_on 59
programming_languages 59
multiple 59
context-insensitive 59
latter 59
3) 59
look 59
LR 59
onto 59
Rules 59
thread 59
ST 59
gen 59
top-down 59
intermediate 58
separate 58
its_own 58
seen 58
transformation 58
needs 58
generally 58
null_space 58
file 58
this_chapter 58
9) 58
transfer 58
regular 58
later 57
unless 57
invocation 57
under 57
efficiently 57
real 57
keep 57
j) 57
group 57
partitions 57
programmer 57
allocation 57
assuming 57
safe 57
practice 57
Rule 57
break 57
matches 57
said 57
dominates 57
be_implemented 56
records 56
target_machine 56
us 56
bc 56
semantics 56
communication 56
locality 56
satisfy 56
scheduled 56
pairs 56
Recall 56
But 56
trees 56
lists 56
programming 56
transitions 56
an_identifier 56
lookaheads 56
Class 56
visited 56
redundant 55
design 55
around 55
array_accesses 55
iteration_space 55
according 55
strategy 55
c_l 55
constructing 55
BDDs 55
Expressions 55
continue 55
t1 55
t2 55
successor 55
clock 55
forward 55
stage 55
entry_node 55
contents 54
Two 54
good 54
d) 54
inside 54
level 54
turn 54
nest 54
Show 54
facts 54
avoid 54
implements 54
ordering 54
Node 54
early 54
align 54
regular_expressions 54
reachable_objects 54
throws_IOException 54
generation 53
equal 53
optimized 53
performance 53
better 53
ambiguous 53
LR_parsing 53
right_side 53
12) 53
chosen 53
start_symbol 53
4)_public 53
car 53
ways 52
(or 52
argument 52
(5) 52
n 52
data_dependences 52
passes 52
-productions 52
leftmost 52
keywords 52
LD 52
Function 52
desired 51
we_wish 51
exist 51
maps 51
dot 51
explicitly 51
bytes 51
c_c 51
lead 51
addition 51
inherited_attribute 51
sum 51
killed 51
D 51
reverse 51
derived_from 51
print 51
induction_variables 51
anticipated 51
various 50
indexes 50
l_l 50
long 50
discover 50
manner 50
memory_location 50
starts 50
As_discussed 50
dimensions 50
property 50
really 50
mapping 50
yet 50
possibly 50
section 50
key 50
live 50
13) 50
BDD's 50
Comm_ACM 50
parsers 50
natural_loops 50
symbolic 49
issue 49
conservative 49
try 49
model 49
translate 49
Although 49
together 49
LR(0)_items 49
base 49
input_string 49
constructor 49
goes 49
z 49
prove 49
software 49
Call 49
2)_import 49
)_return 49
array_elements 48
optimize 48
best 48
details 48
operand 48
illustrate 48
build 48
including 48
handled 48
summarized 48
neither 48
repeat 48
advantage 48
enter 48
tasks 48
Construct 48
Analysis 48
R1 48
Stmt 48
arithmetic 47
Otherwise 47
units 47
ends 47
let_us 47
combine 47
precision 47
alternative 47
1_0 47
run-time 47
study 47
determines 47
LALR 47
live_on 47
matching 47
provided 47
think 47
subset 47
recognize 47
eg 47
clocks 47
nothing 47
predecessors 47
even_though 46
too 46
clone 46
single_node 46
dimension 46
synchronizations 46
provide 46
Another 46
why 46
input_symbol 46
valid 46
eventually 46
essentially 46
load 46
exception 46
In_fact 46
columns 46
tabbing 46
difference 46
subtree 46
applying 46
starting_with 46
prior 46
vhexer 46
checking 46
reducible_flow 46
outermost_loop 46
reads 46
automaton 46
works 46
letter 46
for_(each 46
bit_vectors 46
5)_public 46
making 45
denotes 45
represented 45
statically 45
Given 45
transforms 45
In_general 45
other_hand 45
1_i 45
Any 45
Therefore 45
extra 45
obtained 45
question 45
kills 45
query 45
Many 45
indicate 45
translator 45
start_state 45
tracing 45
retreating_edges 45
specify 44
quite 44
(4) 44
tell 44
treat 44
abstract 44
loop_indexes 44
situation 44
as_long 44
less_than 44
reducing 44
conflict 44
missing 44
points-to_analysis 44
buffer 44
outer 44
bound 44
concept 44
translation_scheme 44
environment 44
(see 44
evaluates 44
available_expressions 44
composition 44
positions 43
conditional 43
They 43
pointer_analysis 43
split 43
parallelize 43
elimination 43
contiguous 43
identify 43
far 43
points-to_relations 43
successors 43
pipelined 43
The_reason 43
14) 43
analyzer 43
collector 43
fully_permutable 43
ADD 43
information_about 42
easier 42
developed 42
legal 42
range 42
places 42
low 42
so_far 42
SLR 42
processing 42
reason 42
expr_then 42
your 42
suitable 42
heap_objects 42
same_location 42
finite 42
code_generator 42
visit 42
mutator 42
root_set 42
DFST 42
train 42
distinct 41
observe 41
In_addition 41
original_program 41
occurs 41
memory_manager 41
bit 41
more_complex 41
high 41
currently 41
examine 41
parsing_action 41
syntactic 41
(the 41
Relations 41
redundancy 41
synthesized_attribute 41
float 41
resource 41
ahead 41
intersection 41
iterative 41
proof 41
there_exists 41
applies 41
semantic 41
optimal 41
family 41
xy 41
subregion 41
implemented 40
creating 40
more_precise 40
invoked 40
queries 40
k 40
loop_index 40
limit 40
overhead 40
fixed 40
greater_than 40
conditions 40
note_that 40
Moreover 40
express 40
sizes 40
remainder 40
placement 40
conflicts 40
eliminating 40
accept 40
w 40
stores 40
leads 40
subexpressions 40
semantic_rules 40
t3 40
illustrated 40
recursive 40
branch 40
linearly_independent 40
callee 40
default 40
accepting_state 40
dominators 40
concepts 39
starting 39
multiplication 39
referred 39
sometimes 39
kind 39
context_sensitivity 39
constraint 39
Fortran 39
rank 39
basis 39
lower 39
performing 39
modified 39
specific 39
difficult 39
loop-invariant 39
presented 39
help 39
context-sensitive_points-to 39
recursion 39
leaving 39
redefined 39
offset 39
loads 39
quicksort 39
initiation_interval 39
especially 38
allowed 38
11 38
Variable 38
comparison 38
depending_on 38
caller 38
acyclic 38
vectors 38
individual 38
exists 38
derive 38
upper_bound 38
common_subexpressions 38
modify 38
associativity 38
routine 38
Datalog_program 38
none 38
invocation_site 38
synthesized_attributes 38
holding 38
code_generation 38
1_2 38
Loops 38
begin_with 38
region-based_analysis 38
word 38
propagate 38
Compute 38
LR(1)_items 38
time-partition_constraints 38
kinds 37
op 37
data_structure 37
moved 37
How 37
call_site 37
No 37
hardware 37
sequential 37
mappings 37
sense 37
equalities 37
assumed 37
remove 37
search 37
configuration 37
portion 37
adds 37
assigns 37
12 37
fully 37
Once 37
region-based 37
expand 37
Access 37
if( 37
(x_- 37
visits 37
R0 37
lookahead_symbol 37
Unscanned 37
benefit 36
q 36
keep_track 36
resolve 36
(6) 36
recursively 36
array_element 36
maximum 36
be_eliminated 36
associated 36
lower_bound 36
reduces 36
consecutive 36
smallest 36
twice 36
arbitrary 36
likely 36
tables 36
full 36
other_words 36
parentheses 36
parse_trees 36
partial 36
semantic_action 36
x_y 36
layout 36
programming_language 36
allows_us 36
common_subexpression 36
entire_flow 36
initialize 36
frameworks 36
obtained_by 36
LR(1) 36
substitute 36
discovered 36
t) 36
topological_order 36
data-flow_equations 36
else_return 36
transition_diagram 36
Unreached 36
DAG 35
explicit 35
logical 35
generator 35
gets 35
analyze 35
predicates 35
regardless 35
interprocedural_analysis 35
infer 35
away 35
th_iteration 35
come 35
total 35
surely 35
support 35
causes 35
relative 35
Parsing 35
scan 35
calling 35
well 35
EDB 35
Every 35
cache_line 35
suggested 35
Intuitively 35
purpose 35
direction 35
induction 35
describes 35
required 35
rather 35
width 35
rightmost_derivation 35
polyhedron 35
involves 35
while_( 35
occurrence 35
data-flow_framework 35
ones 35
alphabet 35
Data 34
Chapter 34
case_where 34
increase 34
writing 34
c1 34
assumption 34
belonging 34
propagated 34
significant 34
free_space 34
sections 34
user 34
error_recovery 34
cause 34
inherited_attributes 34
Block 34
quickly 34
To_see 34
lexemes 34
begins 34
held 34
data-flow_problems 34
cloned 34
backward 34
000_0000 34
body_region 34
peek 34
binary 33
degrees 33
conclude 33
targets 33
largest 33
transformed 33
six 33
i2 33
p) 33
per 33
loop_bounds 33
no_longer 33
fit 33
effective 33
inputs 33
String 33
subclass 33
invocation_sites 33
depend_on 33
rightmost 33
words 33
In_particular 33
flow_graphs 33
15) 33
yields 33
numbered 33
I 33
tools 33
code_motion 33
proceed 33
partial_order 33
denoted_by 33
product 33
monotone 33
saved 33
B_P 33
desirable 32
convert 32
Aij 32
placing 32
yield 32
flow-insensitive 32
interest 32
writes 32
groups 32
satisfied 32
chain 32
bottom 32
greatly 32
garbage_collector 32
bin 32
exact 32
blank 32
at_compile 32
tuples 32
introducing 32
array_access 32
calculation 32
associate 32
previously 32
complex 32
remember 32
To_find 32
detail 32
P 32
phases 32
height 32
Add 32
Return 32
SCC 32
(lines 32
05 32
perhaps 31
front_end 31
specifies 31
intermediate_representation 31
Ai 31
differ 31
theory 31
arrayrr 31
goal 31
relatively 31
sufficient 31
if_(p 31
unnecessary 31
Again 31
Note 31
leave 31
tend 31
Grammars 31
interesting 31
reductions 31
stands_for 31
detect 31
handling 31
named 31
converge 31
faster 31
W 31
zero 31
syntax_trees 31
inherited 31
13 31
enclosing 31
notion 31
16) 31
frequently 31
branches 31
Design 31
Proc 31
text 31
proposed 31
N 31
earliest 31
ML 31
earlier 31
zero_or 31
derivations 31
concatenation 31
IR 31
clones 31
Token 31
current_input 31
matched 31
Scanned 31
side 30
built 30
subclasses 30
procedure_calls 30
arbitrarily 30
source_language 30
subexpression 30
similarly 30
abstraction 30
understand 30
memory_locations 30
More 30
upon 30
context-sensitive_analysis 30
summary 30
c2 30
pick 30
extend 30
indicates 30
provides 30
sentence 30
E_E 30
tabularl_c 30
as_soon 30
scanned 30
kill 30
describing 30
'_' 30
extends 30
Before 30
more_efficient 30
pseudocode 30
backwards 30
matrices 30
entering 30
An_example 30
incremental 30
are_interested 30
hand 30
right-sentential_form 30
-production 30
Line 30
fragment 30
execution_path 30
subregions 30
m 30
three-address_instruction 29
beyond 29
entered 29
analogous 29
opportunities 29
interprocedural 29
analyzed 29
i1 29
for_(i0 29
minimize 29
recovery 29
fly 29
whatever 29
Information 29
Use 29
n) 29
leading 29
replaced 29
representative 29
inner 29
translated 29
live_variables 29
data_locality 29
checks 29
Compiler 29
independently 29
observed 29
LL 29
reading 29
positive 29
policy 29
collected 29
production_body 29
tok 29
begins_with 29
Fig_figdom-fg 29
nonreducible_flow 29
repeated 28
optimizing 28
translations 28
close 28
representations 28
Do 28
Static 28
transform 28
Program 28
computer 28
calling_contexts 28
summarize 28
convenient 28
show_how 28
illustrating 28
equality 28
lines_(4) 28
Second 28
contained 28
Next 28
existence 28
data_structures 28
ET 28
(7) 28
(c) 28
dynamically 28
b_c 28
this_paper 28
This_section 28
Variables 28
guaranteed 28
derived 28
Translation 28
resources 28
higher 28
insert 28
properly 28
for-loop 28
This_approach 28
register_allocation 28
derivable_from 28
viable_prefix 28
we_want 28
sort 28
be_sure 28
reserved 28
precise 28
convergence 28
empty_string 28
lexer_import 28
Pipelining 28
boxes 28
symbol-table_entry 27
deal_with 27
assigning 27
distinguish 27
-1 27
Repeat_Exercise 27
discussing 27
ever 27
involve 27
Flow 27
Its 27
correctly 27
develop 27
Finding 27
requiring 27
1_j 27
diagram 27
dependent 27
limited 27
have_already 27
normally 27
boundary 27
area 27
operating_system 27
nor 27
adjacent 27
almost 27
adding 27
(_) 27
moves 27
an_infinite 27
S-attributed 27
derives 27
Give 27
Other 27
take_advantage 27
relevant 27
five 27
node_labeled 27
identity 27
parent 27
Apply 27
G 27
context-sensitive_pointer 27
Flow_graph 27
formed_by 27
handles 27
tells_us 27
look_at 27
Method 27
return_new 27
treated_as 27
affine_expressions 27
Nodes 27
while-loop 27
Lines 27
Algorithm_algreaching-definitions 27
depth-first_ordering 27
Id 27
unreachable 27
dominator 27
kernels 27
threads 27
three-address_statements 26
implemented_by 26
ai 26
expensive 26
impossible 26
constant_propagation 26
Control 26
Most 26
mechanism 26
normal 26
program's 26
formulation 26
numerical 26
innermost_loop 26
by_replacing 26
different_processors 26
identified 26
Formally 26
Simple 26
be_expressed 26
usage 26
principle 26
Free 26
ambiguous_grammar 26
Sets 26
ambiguity 26
detected 26
attempts 26
particularly 26
Languages 26
considering 26
H 26
inserted 26
substring 26
architecture 26
issues 26
fall 26
17) 26
systems 26
decision 26
be_solved 26
tool 26
syntax-directed 26
substitution 26
copying 26
shift-reduce_parser 26
Prove 26
data-flow_analyses 26
propagates 26
cyclic 26
src 26
collect 26
Word 26
2)_public 26
depth-first 26
symbolic_map 26
usual 25
Unfortunately 25
able 25
subsequently 25
Furthermore 25
exits 25
invocations 25
identity_function 25
Datalog_programs 25
variety 25
minimizing 25
short 25
assignment_statement 25
ID 25
arrayl 25
s1 25
unknown 25
data-dependence 25
essential 25
inner_loops 25
relationship_between 25
allocate 25
Object 25
treated 25
private 25
starting_at 25
assumes 25
remain 25
produced_by 25
by_looking 25
expect 25
parts 25
e) 25
compare 25
sensitivity 25
anything 25
new_T() 25
defining 25
specifying 25
identical 25
iff 25
interior_node 25
significantly 25
synthesized 25
advance 25
fourth 25
related 25
introduces 25
code-generation 25
referenced 25
wish 25
stream 25
apply_Algorithm 25
saw 25
blocking 25
programmers 25
ensure_that 25
State 25
Equations 25
most_important 25
by_composing 25
empty_set 25
initial_node 25
delay 25
IF 25
depth-first_spanning 25
Fig_figdepth-first 25
postfix 25
subscripts 24
control-flow 24
questions 24
approximation 24
efficiency 24
major 24
local_variables 24
determining 24
g 24
presence 24
based 24
routines 24
unit 24
dynamic_accesses 24
they_were 24
virtual 24
denoted 24
designed 24
upper 24
line_(4) 24
Likewise 24
Statements 24
delete 24
spatial_locality 24
16 24
remains 24
specification 24
E_EE 24
accessible 24
belong 24
relationship 24
at_run 24
join 24
taking 24
top-down_parsing 24
building 24
embedded 24
parallelizable 24
boolean_expressions 24
illustrates 24
maintain 24
leader 24
requirement 24
Computing 24
code_optimization 24
formal 24
LL(1) 24
did 24
lattice 24
accepting_states 24
Not 24
setting 24
eliminated 24
switch 24
formal_parameter 24
invocation_edges 24
opportunity 24
semantic_rule 24
debug 24
compiled 24
Xij 24
(i 24
summaries 24
Set 24
attempt 24
(line 24
definition_reaches 24
point_(5) 24
Algorithm_algiterative 24
f(_) 24
null_) 24
nested_within 24
SLR(1) 24
kernel 24
match('') 24
access_link 24
together_with 23
Alternatively 23
be_combined 23
relop 23
indicating 23
high-level 23
aliases 23
Even 23
matter 23
exponential 23
boundaries 23
going 23
implementations 23
Shown 23
expected 23
Initially 23
managed 23
Fourier-Motzkin_elimination 23
line_(1) 23
running_time 23
select 23
simplify 23
Examples 23
power 23
combination 23
languages_like 23
things 23
situations 23
natural 23
r2 23
(8) 23
decisions 23
behavior 23
until_no 23
BDD_operations 23
accepts 23
standard 23
sites 23
SDD's 23
num 23
steady_state 23
replaces 23
constant_folding 23
17 23
Software 23
Farkas'_Lemma 23
Programs 23
Context-sensitive 23
automata 23
vary 23
redundancies 23
exploit 23
little 23
GCD 23
u 23
site 23
former 23
running 23
benchmarks 23
R3 23
h) 23
postponable 23
Transfer 23
dead 23
inter_File 23
s) 23
dst 23
predictive_parsing 23
SP 23
relational 22
machine_instructions 22
indirect 22
new_temporary 22
treating 22
yes 22
by_applying 22
hard 22
chapter 22
h 22
diagrams 22
2-dimensional 22
runs 22
n_j) 22
divide 22
working 22
satisfies 22
(s2) 22
rewrite 22
replacing 22
increases 22
sequentially 22
what_follows 22
simpler 22
happens 22
fewer 22
special_case 22
r 22
shiftreduce_conflict 22
tabularp_l 22
obvious 22
domains 22
formal_parameters 22
passing 22
series 22
universal_set 22
L-attributed 22
Constructing 22
combining 22
dependency_graph 22
Specifically 22
balanced 22
have_seen 22
goto_L 22
looks 22
Further 22
associative 22
ideas 22
old 22
call_paths 22
Lam 22
(a 22
dynamic_programming 22
decide 22
Fig_lr-states-fig 22
others 22
discovery 22
necessarily 22
independent_solutions 22
save 22
encountered 22
replacement 22
cloning 22
j_n 22
shall 22
activation_records 22
collecting 22
every_path 22
rate 22
hsexer 22
Expr_x 22
accepting 22
transition_diagrams 22
belongs 22
induction_variable 22
backtracking 22
newline 22
hash_table 22
lexer_File 22
retreating_edge 22
nonreducible 22
LALR(1) 22
outermost_fully 22
triples 21
In_practice 21
temporaries 21
unary 21
presumably 21
v) 21
translating 21
triple 21
consist 21
knowing 21
report 21
simplified 21
knows 21
precisely 21
throughout 21
distinguish_between 21
into_account 21
call_sites 21
extended 21
affine_partition 21
space-partition_constraints 21
statement_nested 21
i' 21
not_necessarily 21
removed_from 21
separately 21
specialized 21
primitive 21
Memory 21
implementing 21
performs 21
Rather 21
affect 21
ordered 21
60 21
state_7 21
r2_r2 21
stmt_else 21
r_l 21
equivalence_class 21
To_compute 21
powerful 21
tuple 21
Conversely 21
descriptors 21
equals 21
approaches 21
bottom-up_parsing 21
abstract_syntax 21
nontrivial 21
while-statement 21
difference_between 21
right_child 21
Array 21
x_ai 21
possibility 21
formed 21
intended 21
Edges 21
modern 21
(and 21
Introduction 21
involved 21
Parser 21
during_parsing 21
longer 21
separated_by 21
left_side 21
(which 21
(in 21
specified_by 21
i_n 21
Execution 21
Transfer_Functions 21
boundary_condition 21
closest 21
4i 21
18) 21
6)_public 21
Grammar 21
white_space 21
reserved_words 21
pop 21
reference_variables 21
time-partition 21
predictive_parser 21
left-recursive 21
cars 21
nesting_depth 21
three-address_instructions 20
Symbolic 20
minus 20
comes 20
pointed 20
Why 20
processed 20
differently 20
hence 20
convention 20
ask 20
negative 20
be_able 20
tries 20
flow-sensitive 20
via 20
context-insensitive_analysis 20
bytecodes 20
20 20
solving 20
nesting 20
modification 20
nests 20
initially 20
large_number 20
be_parallelized 20
formally 20
p2 20
mentioned 20
data-dependent 20
unknowns 20
Algorithm_algsync 20
Notice 20
selected 20
motion 20
rewriting 20
innermost_loops 20
0) 20
(s1) 20
run-time_stack 20
holes 20
circumstances 20
prefer 20
total_number 20
free_list 20
straightforward 20
idid 20
grouped 20
r1 20
r3_r3 20
(9) 20
marks 20
removed 20
lot 20
approximate 20
repeatedly 20
rule_(2) 20
equationarraylcl 20
equationarray 20
though 20
linear_inequalities 20
factors 20
changing 20
software_pipelining 20
boolean_expression 20
just_before 20
semantic_actions 20
tabularc_c 20
left_child 20
Now_consider 20
interior_nodes 20
Programming 20
E_T 20
sentential_form 20
mark 20
tabularp_p 20
successive 20
LR(0)_automaton 20
kernel_items 20
tell_us 20
inequality 20
affine_expression 20
integer_solutions 20
says 20
understanding 20
propagation 20
forward_data-flow 20
longest 20
arrayl_l 20
data-flow_problem 20
placed_at 20
Data-Flow_Analysis 20
possible_execution 20
notice 20
001_0111 20
draw 20
(eqmono2) 20
dominate 20
collectors 20
reasonable 20
Redundancy 20
NFA's 20
case_'' 20
Fig_figlocal-cse-after 20
lcl 20
unsafe_objects 20
syntax_File 20
Procedure 19
attached 19
102 19
copy_statement 19
incorrect 19
choosing 19
initialized 19
critical 19
In_contrast 19
(11) 19
side_effects 19
whole 19
modeled 19
acyclic_path 19
loop_nests 19
-dimensional 19
option 19
one-dimensional 19
s2 19
iterates 19
Of_course 19
allocated_objects 19
careful 19
speed 19
32 19
(expr-gram-display) 19
augmented 19
Assuming 19
resolved 19
acc 19
2_4 19
effects 19
database 19
copied 19
SQL 19
least 19
storing 19
speed_up 19
skip 19
member 19
underlying 19
translates_into 19
Instruction 19
evaluations 19
its_children 19
behave 19
Flow_Graphs 19
included 19
converted 19
compiling 19
large_programs 19
subset_construction 19
LR_parsers 19
LALR_parser 19
18 19
temporary_variables 19
completes 19
not_yet 19
token_id 19
Even_if 19
Fortunately 19
stmts 19
program_fragment 19
correctness 19
stages 19
top_element 19
mean 19
m) 19
polymorphic 19
traversal 19
111_0000 19
everything 19
template 19
LD_R1 19
MUL 19
newlabel() 19
expr2 19
options 19
deleted 19
Region-Based_Analysis 19
(int_v) 19
return_address 19
underlying_grammar 19
bodies 19
Parsers 19
core 19
permutable_loops 19
Rule_() 19
term() 19
BR 19
translated_into 18
moving 18
balance 18
implies 18
intraprocedural 18
presents 18
allowing 18
surrounding 18
k) 18
produced 18
expressed 18
choices 18
Like 18
p1 18
partition_mappings 18
consequence 18
touch 18
regarding 18
double 18
for_(j0 18
completely 18
Heap 18
deallocated 18
Space 18
practical 18
doing_so 18
physical 18
carefully 18
strictly 18
be_parsed 18
semicolon 18
right_parenthesis 18
tabularcenter 18
aliased 18
For_simplicity 18
-_(v1fv2) 18
directed 18
type_checking 18
desk_calculator 18
Assume 18
compilation 18
fast 18
Sometimes 18
past 18
simplest 18
reader 18
See 18
exercises 18
Computation 18
arithmetic_expressions 18
Lexical 18
cache_lines 18
id_id 18
terminal_symbols 18
stack_contents 18
course 18
initial_state 18
recognizing 18
NFA_states 18
saves 18
IDB_predicate 18
Dynamic 18
Remember 18
library 18
numbering 18
optexpr 18
partial_redundancy 18
different_contexts 18
Unlike 18
finite_height 18
Data-Flow 18
v2) 18
omitted 18
occurrences 18
relative_address 18
Typically 18
symbol_tables 18
entry) 18
iterative_data-flow 18
lattices 18
f(_x 18
f) 18
symbolic_constant 18
8)_public 18
19) 18
one_predecessor 18
region_hierarchy 18
retreating 18
2pt 18
move() 18
left_recursion 18
fun 18
this_book 17
conversion 17
i_i1 17
internal 17
treats 17
answers 17
trying 17
structures 17
scanning 17
fundamental 17
scalable 17
escape_analysis 17
levels 17
n_i) 17
makes_sense 17
sharing 17
by_adding 17
solved 17
half 17
pages 17
supports 17
EE 17
(E) 17
LR(0) 17
(10) 17
designing 17
And 17
analyzing 17
objects_created 17
subgoals 17
Applying 17
specified 17
accessing 17
unsafe 17
Attributes 17
costs 17
concrete 17
effectively 17
shared 17
improving 17
indices 17
software-pipelined_loop 17
marker 17
while-statements 17
anywhere 17
improvement 17
appearing 17
existing 17
Elimination 17
descendant 17
proceeds 17
at6 17
liveness 17
heuristics 17
merged 17
clear 17
encode 17
Operations 17
odd 17
et_al 17
Programming_Languages 17
Eliminating 17
reported 17
Ullman 17
formula 17
improvements 17
context-free 17
generators 17
nonrecursive 17
Incremental 17
structured 17
expansion 17
reused 17
canonical 17
orders 17
code_fragment 17
An_important 17
off 17
actual_parameter 17
did_not 17
maximal_set 17
subscript 17
keeping 17
potentially 17
destination 17
Basic 17
Constant 17
L1 17
new_label 17
depth-first_order 17
Write 17
converges 17
latest 17
execution_paths 17
subsets 17
data-flow_schema 17
Reaching_Definitions 17
through_(6) 17
Iterative_algorithm 17
its_predecessors 17
intuitive 17
unreachable_objects 17
declare 17
environments 17
top_region 17
SDT's 17
synthesize-record 17
new_Word( 17
predictive 17
cards 17
Env 17
topsp 17
extends_Stmt 17
figurehtbf 16
object-oriented 16
outlined 16
r-value 16
optimizer 16
exceptions 16
undecidable 16
Accesses 16
Besides 16
Clearly 16
models 16
sensitive 16
SPMD 16
example_illustrates 16
partitioning 16
spaces 16
reflects 16
limits 16
smaller_than 16
lie 16
tests 16
minimum 16
something 16
shortly 16
mapped 16
requests 16
lifetimes 16
future 16
fragmentation 16
improves 16
manipulate 16
ambiguous_grammars 16
shorter 16
be_resolved 16
Productions 16
canonical_LR 16
s5 16
dangling-else 16
pieces 16
assure 16
Field 16
assignable 16
You_may 16
succinct 16
type_filter 16
truth 16
paths_leading 16
variable_ordering 16
ability 16
Construction 16
Syntax 16
subtrees 16
Nonterminal 16
shows_how 16
annotated_parse 16
So 16
Optimization 16
completed 16
ab 16
looking 16
no_matter 16
Often 16
FALSE 16
opposite 16
Both 16
01 16
by_taking 16
NOT 16
Computer 16
J_D 16
context-free_grammar 16
familiar 16
(Algorithm 16
versions 16
recursive-descent_parser 16
style 16
with_respect 16
Fid 16
TF 16
During 16
giving 16
suggests 16
expr_expr 16
i_j 16
Put_another 16
Tokens 16
Implementing 16
token_name 16
allow_us 16
diagonal 16
syntax-directed_definition 16
requirements 16
peephole 16
As_another 16
partial-redundancy_elimination 16
r3 16
cache_misses 16
R5 16
scheduler 16
Is 16
rel 16
Production 16
greater 16
(as 16
public 16
initialization 16
illustrate_how 16
indicated 16
001_1110 16
Available_Expressions 16
Algorithm_1018 16
y_) 16
Fig_figdf-alg(a) 16
division 16
parse-tree_node 16
calculations 16
gen() 16
20) 16
expr1 16
vP 16
t9 16
Where 16
bool 16
whitespace 16
anticipated_at 16
wavefront 16
dual_system 16
lemma 16
Mapping_i2 16
i_j2 16
maximum_degree 16
9-52 16
Instructions 15
Their 15
symbol-table 15
conditional_statement 15
anyway 15
pointer_alias 15
retain 15
243 15
undefined 15
Context 15
helpful 15
DW1kji 15
responsible_for 15
0_0 15
grouping 15
essence 15
two-dimensional 15
Execute 15
ranges 15
Algorithm_algnosync 15
nonempty 15
larger_than 15
intermediate-code 15
sure 15
reside 15
hole 15
tends 15
Within 15
combined 15
namely 15
preceding 15
more_detail 15
fashion 15
guarantee 15
SLR_parser 15
Fig_action-goto-fig 15
We_conclude 15
favor 15
resolution 15
already_been 15
andor 15
eliminates 15
counts 15
potential 15
Without 15
simulate 15
many_times 15
account 15
conclusion 15
ignore 15
v1 15
Datalog_rules 15
reflect 15
extract 15
Had 15
Perform 15
using_BDDs 15
context-insensitive_points-to 15
Domains 15
T_T 15
acyclic_graph 15
commonalities 15
X 15
carry 15
preferable 15
instruction-level_parallelism 15
machine_instruction 15
misses 15
B2 15
readch() 15
algebraic 15
c' 15
middle 15
Only 15
doesn't 15
t5 15
comes_from 15
leaf_labeled 15
second_component 15
be_viewed 15
SIGPLAN 15
Programming_Language 15
showed 15
Blocking 15
extensions 15
mathematical 15
context-free_grammars 15
22 15
ideal 15
Ershov 15
14 15
multiply 15
grammar_(expr-gram-display) 15
shift-reduce 15
-2pt 15
locate 15
STACK_INPUT 15
States 15
occurs_when 15
indexed 15
viable_prefixes 15
drop 15
nonzero 15
x2 15
virtual_method 15
terminates 15
algorithm_converges 15
view 15
helps 15
Section_secdf-intro 15
hierarchical 15
suffices 15
members 15
strategies 15
distributive 15
context-sensitive_invocation 15
recursive_cycles 15
incoming 15
context_numbers 15
roles 15
Which 15
s7 15
Evaluation 15
incrementally 15
incremented 15
Stack 15
point_immediately 15
not_killed 15
control-flow_graph 15
Define 15
definitely 15
recomputed 15
rewritten 15
behaves 15
317ptstabularl 15
R0_R0 15
temporary_variable 15
9)_public 15
Functions 15
DFA's 15
stand_for 15
failure_function 15
binding 15
outermost 15
link 15
only_difference 15
against 15
'_int 15
Token_t 15
TypeInt 15
any_acyclic 15
add_edge 15
without_going 15
copy_propagation 15
Unscanned_state 15
unscanned 15
activations 15
exchange 15
rvalue 15
NewLocation 15
interior 14
Copy 14
actual_parameters 14
clearly 14
learn 14
imprecise 14
unchanged 14
calling_context 14
vice_versa 14
thousands 14
minutes 14
(k 14
th_element 14
improved 14
degree 14
Constraints 14
divides 14
located 14
scale 14
basis_vectors 14
200 14
To_avoid 14
splitting 14
(i1 14
Bi 14
byte 14
coalesce 14
utilization 14
Boundary 14
right_end 14
altogether 14
(expr-ambig-display) 14
takes_precedence 14
shifting 14
deciding 14
left_associative 14
method_named 14
knowledge 14
showing 14
ignoring 14
EDB_predicates 14
extension 14
describe_how 14
(h1fh2) 14
(v2h2) 14
communicate 14
meaningful 14
type-safe 14
compact 14
Production_Semantic 14
bottom-up_parse 14
functional 14
fetched 14
ready 14
estimate 14
prefetch 14
manage 14
jumping_code 14
Semantic 14
line_4 14
covered 14
K 14
subtraction 14
arrange 14
doing 14
t4 14
truth_assignment 14
see_how 14
Hennessy 14
M_S 14
architectures 14
were_introduced 14
ACM 14
Systems 14
123 14
security 14
informally 14
Report 14
synthesis 14
Available 14
86 14
19 14
reachability 14
train_algorithm 14
monotonicity 14
Xi 14
Blocks 14
Apply_Algorithm 14
prefixes 14
recognizes 14
Expression 14
Yij 14
focus_on 14
greatest 14
summarizes 14
Sections 14
class_hierarchy 14
encodes 14
Machine 14
Scheduling 14
(see_Section 14
R4 14
subgraph 14
Values 14
product_lattice 14
greatest_lower 14
semilattices 14
C_H 14
top-down_pass 14
infinite 14
recursive_calls 14
s6 14
atom 14
claim 14
char 14
shortest 14
cycle-free_path 14
quantities 14
initializes 14
seeing 14
set_intersection 14
initialized_with 14
evaluating 14
assembly 14
macro 14
Tree 14
Whenever 14
spatial 14
4_5 14
basic_induction 14
Fig_figqs-code 14
pf 14
21) 14
String_toString() 14
Num 14
new_Token('') 14
reserve(_new 14
immediate_dominator 14
A_typical 14
postponed 14
leaf_regions 14
symbolic_maps 14
Time-Partition_Constraints 14
untrusted_code 14
trains 14
first_train 14
bucket 14
StmtBreakFrom 14
ytabc 14
For_convenience 13
param 13
reordering 13
sake 13
complexity 13
This_paper 13
succinctly 13
portions 13
Affine 13
iteration_spaces 13
dynamic_instance 13
Generate 13
satisfying 13
(not_necessarily 13
acceptable 13
observation 13
static_access 13
puts 13
F1_i1 13
f1_F2 13
i2_f2 13
C1i1_c1 13
project_away 13
through_(7) 13
Or 13
allocates 13
request 13
Allocation 13
requested 13
getting 13
Lisp 13
most_common 13
overall 13
page 13
substantial 13
tabularcc_c 13
r1_r1 13
augmented_grammar 13
standing 13
line_(5) 13
line_(9) 13
approximations 13
accurate 13
alternatives 13
pointing 13
concentrate_on 13
IDB_predicates 13
inferences 13
x) 13
Berndl 13
conjunction 13
object_created 13
explain 13
high_edge 13
postorder_traversal 13
distinguished 13
innermost 13
false_exits 13
B1 13
builds 13
dead_code 13
preserved 13
thereby 13
reasons 13
halt 13
two_successors 13
ordinary 13
Identify 13
TRUE 13
their_union 13
numeric 13
multiprocessor 13
94 13
nested_loops 13
J_ACM 13
Checking 13
development 13
Algol_60 13
24 13
Knuth 13
rarely 13
demonstrated 13
Johnson 13
Error 13
Language 13
Objects 13
expanded 13
would_require 13
Zi 13
Reuse 13
Loop 13
towards 13
shift-reduce_parsing 13
input_buffer 13
hope 13
running_example 13
guide 13
Definition 13
determine_whether 13
importance 13
x1 13
Summary 13
extent 13
on-the-fly 13
Make 13
This_chapter 13
has_rank 13
j_j-1 13
Logical 13
hierarchical_structure 13
commonly_used 13
advantages 13
block-structured 13
marked 13
barriers 13
C_V 13
arrayll 13
allocation_site 13
pmd 13
THE 13
lowest 13
sketch 13
Solving 13
deduce 13
dummy 13
conventions 13
truly 13
confluence 13
125 13
ten 13
be_rewritten 13
most_precise 13
traversed 13
These_equations 13
-value 13
)_f( 13
apparent 13
role 13
transitive 13
Definitions 13
emit 13
10)_public 13
emit( 13
dead_state 13
Code_Motion 13
vPfilter 13
alone 13
dom 13
self-spatial_reuse 13
leading_from 13
(12) 13
printed 13
prints 13
TypeFloat 13
''_) 13
cross_edges 13
SLR_method 13
Fig_figpre(a) 13
-_kill) 13
summation 13
StmtEnclosing 13
'-' 13
'_'code 13
left_recursive 13
interval 13
data-dependence_graph 13
access_links 13
Symbol 13
StmtNextFrom 13
reached-bit 13
Yacc_specification 13
Three-address_code 12
backpatching 12
optional 12
l-value 12
103 12
harder 12
Hence 12
non-negative 12
nature 12
different_ways 12
attach 12
reasoning 12
Interprocedural 12
conservatively 12
applicable 12
alias_analysis 12
strongly 12
highly_efficient 12
Having 12
(with 12
scalar 12
safely 12
one_unit 12
discuss_how 12
highest 12
coordinates 12
imposed_by 12
C1 12
loss 12
special_cases 12
want 12
original_sequential 12
repeated_here 12
lower_bounds 12
magnitude 12
duplicated 12
deallocation 12
grow 12
prepared 12
sorted 12
tag 12
unambiguous_grammar 12
commonly 12
unambiguous 12
tabularp_c 12
2-7 12
(for 12
Implement 12
correction 12
pointer-alias_analysis 12
One_way 12
h_T 12
superclass 12
restriction 12
Adding 12
go_through 12
checked 12
overview 12
eqnarray 12
minimal 12
an_optional 12
(v 12
points-to_relation 12
type_filtering 12
highly 12
literature 12
boolean_functions 12
packages 12
subgoal 12
deals_with 12
syntax-tree_node 12
Steps 12
message 12
without_having 12
unroll 12
depth-first_traversal 12
else_if( 12
(d) 12
Chapter_code-op-ch 12
detecting 12
commutative 12
worry_about 12
(13) 12
executable 12
Implementation 12
It_turns 12
AND 12
Recursively 12
take_up 12
integer_linear 12
gain 12
constant-propagation 12
vulnerabilities 12
inductive 12
Z 12
35 12
finite_automata 12
direct 12
simulation 12
Algorithms 12
recursive-descent 12
parsing_tables 12
computers 12
parser_generator 12
(that 12
several_times 12
arithmetic_operations 12
optimal_code 12
Graph 12
21 12
faster_than 12
Observe 12
executions 12
T_F 12
primary 12
canonical_collection 12
One_solution 12
matrix-vector 12
Region 12
Solution 12
True 12
-deep_loop 12
Data_dependence 12
nullity 12
jumping 12
call_targets 12
invoke 12
explained 12
redefine 12
lexer 12
package 12
programming-language 12
visiting 12
schemes 12
Environments 12
management 12
preserve 12
great 12
code_improvement 12
context-sensitive_results 12
deep 12
schedules 12
Example_exscc2 12
s3 12
s4 12
data-flow_schemas 12
generic 12
reduced_call 12
omit 12
More_precisely 12
IDB 12
reaching-definitions 12
backward-flow 12
schema 12
expense 12
Fig_figreach-def 12
live_coming 12
no_subsequent 12
available-expressions 12
Meet_() 12
yz 12
glb 12
(eqmono1) 12
ideal_solution 12
LD_R0 12
SUB 12
tree-rewriting 12
collections 12
lexline 12
ending 12
Dstates 12
speaking 12
next_character 12
IE 12
trace-based 12
arrow 12
mode 12
increment 12
2-deep_loop 12
increments 12
compose 12
captured 12
(21) 12
at2 12
Fig_figqs-fg 12
preceded 12
sign 12
TypeBool_) 12
text_string 12
popped 12
remaining_input 12
into_postfix 12
collects 12
peek_' 12
if(_readch('') 12
yylval 12
Your_flow 12
kernel_item 12
force 12
expression_bc 12
(gen1 12
finishes 12
signals 12
synch-pipe-fig 12
Example_exnsync1 12
timestep 12
primal_system 12
permutable 12
cholesky-fig 12
non-private 12
StmtNull 12
match(')') 12
look_move() 12
Predictive 12
left-recursion 12
SOR_code 12
newStates 12
addState 12
synchronizing_tokens 12
Fig_yacc-ambig-fig 12
kept 11
alter 11
negation 11
104 11
neither_nor 11
abstractions 11
areas 11
Not_only 11
defer 11
precedes 11
varies 11
programs_written 11
Normally 11
Parallelism 11
parallelizing 11
depends 11
reuses 11
gives_us 11
arrayrrr 11
operating 11
serially 11
happen 11
Note_however 11
C11_C12 11
matrix_F 11
interleave 11
make_sure 11
Generating 11
project 11
cover 11
our_running 11
Generate_code 11
accommodate 11
manual 11
minimizes 11
fraction 11
managing 11
bit_vector 11
selecting 11
theorem 11
recognized 11
left-associative 11
conditional_statements 11
rise 11
terminology 11
panic-mode 11
removing 11
pushing 11
will_eventually 11
push_state 11
render 11
creation 11
suggest 11
restrictions 11
introduction 11
surrounded_by 11
transitive_closure 11
Types 11
Domains_from 11
subtype 11
Algorithm_algci-types 11
Efficient 11
variant 11
expressions_involving 11
postfix_notation 11
SIMD 11
advanced 11
caches 11
issued 11
enclosing_loop 11
finished 11
Basic_Blocks 11
subject 11
reorder 11
laws 11
Common 11
miss 11
expose 11
more_expensive 11
compile 11
treated_like 11
suffice 11
benefits 11
instruction_selection 11
branching 11
possibilities 11
at4 11
row-major 11
fall_through 11
row-major_order 11
Diagrams 11
Initialization 11
Global 11
simultaneously 11
detailed 11
Theory 11
Later 11
touches 11
MA 11
S_C 11
Regular 11
front 11
active 11
coloring 11
(eg 11
90 11
upon_entry 11
be_exploited 11
Fig_mm-basic-fig 11
carries 11
permutable_loop 11
LR_grammars 11
indeed 11
stack_holds 11
somewhere 11
valid_items 11
Remove 11
many_cases 11
integer_solution 11
bounded 11
Input 11
eof 11
scans 11
reserve 11
receiver_object 11
formulate 11
rule_says 11
effort 11
care 11
increasing 11
finally 11
distinguishes 11
Between 11
low-level 11
machine_model 11
deal 11
OUT 11
IN 11
Section_secopt-sources 11
Among 11
Register 11
average 11
change_what 11
speculatively 11
simplicity 11
impose 11
alg1sync 11
Algorithm_alg1sync 11
not_distributive 11
Meet 11
purposes 11
interior_points 11
definitions_reaching 11
Context-Sensitive 11
(v1 11
factory 11
cloned_call 11
bool-3code-sdd 11
bottom-up_pass 11
distinguishing 11
c3 11
converting 11
kill_sets 11
saying 11
substituting 11
any_occur) 11
Declarations 11
followed 11
figdf-abs 11
control_reaches 11
genB 11
possible_executions 11
decreases 11
B4 11
meet_operation 11
Fig_fg1-fig 11
Frameworks 11
forwards 11
meet_over 11
consistent_with 11
Partial 11
imposes 11
largest_number 11
f2 11
st 11
minimum_cost 11
R1_R1 11
LD_R2 11
L-attributed_SDD 11
successively 11
static_int 11
Op 11
nullable 11
minimum-state_DFA 11
Transition 11
Tables 11
enters 11
achieved 11
File 11
t7 11
memory_leaks 11
barrier 11
term_term 11
leftmost_derivation 11
m(v) 11
decls 11
(14) 11
244 11
interpreter 11
templates 11
shifts 11
23 11
25 11
22) 11
23) 11
preorder 11
action-record 11
tab 11
open 11
escaped 11
depth-first_search 11
its_tail 11
LALR_parsing 11
89 11
loop-invariant_expressions 11
partially_redundant 11
lazy_code 11
Fig_pipeline-nest-fig 11
pipelined_parallelism 11
Appendix 11
Each_processor 11
unreached 11
79 11
Stmt_stmt 11
expr() 11
marking 11
diagonals 11
rest() 11
alreadyOn 11
non-left-recursive 11
Left 11
eliminate_left 11
mark-and-sweep 11
stable 11
address_descriptor 11
LR-parsing 11
Example_exdoall 11
Algorithm_algsp-cyclic 11
lvalue 11
synchronizing_set 11
Expr_x1 11
Temp 10
passes_through 10
assumptions 10
useless 10
track 10
modifications 10
More_specifically 10
indirectly 10
flows 10
callees 10
super 10
abstracts 10
hundreds 10
studying 10
characteristics 10
temporal_locality 10
Parallel 10
multidimensional 10
imagine 10
matrix_multiplication 10
elementary 10
two-dimensional_array 10
restrict 10
Aij_Aij 10
dots 10
C21 10
guarantees 10
Techniques 10
upper_bounds 10
(p 10
obviously 10
conditionals 10
(p1 10
Ai-1j 10
dependencies 10
deallocates 10
serves 10
manually 10
To_begin 10
heap_storage 10
Starting 10
keeps_track 10
free_chunks 10
freed 10
Efficiency 10
Doing_so 10
Locality 10
empirically 10
best-fit 10
Eventually 10
tells 10
Part 10
40 10
Certain 10
two_reasons 10
Parsing_table 10
Ambiguity 10
avoided 10
parsed 10
caught 10
e3 10
parsing-action_conflicts 10
How_would 10
Model 10
an_unbounded 10
inclusion-based 10
line_(3) 10
lines_(1) 10
copied_into 10
vf 10
rule_(3) 10
catch 10
declarative 10
operates 10
brief 10
allocation_sites 10
(vh)_- 10
(v1h) 10
store_instructions 10
rename_operations 10
rename 10
renaming 10
incrementalization 10
identifies 10
share_many 10
low_edge 10
calculate 10
deductive_engine 10
BDD-based 10
thought 10
conflicting 10
job 10
appeared 10
Extend 10
sends 10
achieve 10
operate 10
addressed 10
filled 10
Boolean 10
10pt 10
fills 10
control_flows 10
permit 10
peek_') 10
progressively_larger 10
graph) 10
cheaper 10
symbolic_constants 10
four_bytes 10
t6 10
concern 10
depend 10
besides 10
conventional 10
exponentially_many 10
merge 10
principal 10
Create 10
parallel_execution 10
organization 10
111 10
throughput 10
Computer_Science 10
Matrix 10
blocked 10
Methods 10
Pascal 10
Chomsky 10
Syntax-directed 10
syntactic_structure 10
lex 10
nondeterministic_finite 10
today 10
LR() 10
testing 10
77 10
unification 10
dynamic_scope 10
generational 10
R_R 10
fixed_number 10
connected 10
134 10
Algorithm_algpar 10
Iterations 10
Even_though 10
An_equivalent 10
disjoint 10
blocked_version 10
data_accessed 10
consecutive_iterations 10
group_reuse 10
Putting 10
left-to-right_scan 10
Items 10
throw 10
by_examining 10
took 10
Regions 10
More_generally 10
triangular 10
Output 10
write_reference 10
Integer 10
36 10
rational 10
situations_where 10
command 10
spurious 10
slow 10
were_able 10
line_(7) 10
codes 10
some_cases 10
compiler_front 10
Interchange 10
15 10
ambiguities 10
production_bodies 10
curly_braces 10
ensures 10
gather 10
simply_apply 10
converts 10
features 10
register_R1 10
generality 10
Graphs 10
i100_i) 10
Propagation 10
many_ways 10
bottom_element 10
Results 10
chooses 10
invocation_edge 10
counting 10
hT 10
Algorithm_algcs 10
paths_reaching 10
composed 10
collapsing 10
two_parts 10
considers 10
About 10
c0 10
negated 10
moment 10
EDB_predicate 10
higher_precedence 10
unused 10
fresh 10
forward-flow 10
3)_while 10
composing 10
entrance 10
global_common 10
relate 10
figavail-exp-alg 10
exit) 10
abc 10
lattice_diagram 10
proven 10
no_greater 10
instruction_LD 10
big_child 10
R2_R1 10
Hint 10
Algorithm_my-alg 10
offsets 10
star-node 10
input_characters 10
lexical_analyzers 10
t8 10
Collectors 10
memory_usage 10
Reference 10
nonlocal 10
trace 10
two_clocks 10
programming_constructs 10
